package module_1.task1_3;

public class Task1_3 {
  public static void main(String[] args) {
    // Задача 1.3.1: Привет, мир!
    System.out.println("Привет, мир!");

    // Задача 1.3.2: Ответ на главный вопрос
    int number = 42;
    System.out.println("Ответ на главный вопрос жизни, вселенной и всего такого: " + number);

    // Задача 1.3.3: Число Пи
    double pi = 3.14159;
    System.out.printf("Число Пи равно %.2f\n", pi);

    // Задача 1.3.4: Имя и возраст
    String name = "Иван";
    int age = 25;
    System.out.println("Имя: " + name + ", Возраст: " + age);

    // Задача 1.3.5: Символ гордости
    char symbol = 'Я';
    System.out.println(symbol + " – символ гордости!!");

    // Задача 1.3.6: Логическое значение
    boolean truth = true;
    System.out.println("Это правда? " + truth);

    // Задача 1.3.7: Большое число
    long bigNumber = 9_223_372_036_854_775_807L;
    System.out.println("Большое число: " + bigNumber);

    // Задача 1.3.8: Дробное число
    float fraction = 123.4567f;
    System.out.printf("Дробное число: %.2f\n", fraction);

    // Задача 1.3.9: Местоположение
    String city = "Москва";
    System.out.println("Местоположение: " + city);

    // Задача 1.3.10: Разность чисел
    int x = 15, y = 7;
    System.out.println(x + " - " + y + " = " + (x - y));
  }
}
